app/controllers/api/feeds_controller.rb

SELECT "feed_follows".* FROM "feed_follows" WHERE "feed_follows"."feed_id" = $1  [["feed_id", 8]]
SELECT "feeds".* FROM "feeds"
---
  def index
    render :json => Feed.all, include: :feed_follows