app/controllers/api/follows_controller.rb

INSERT INTO "feed_follows" ("created_at", "feed_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 21 Nov 2014 01:11:07 UTC +00:00], ["feed_id", 4], ["updated_at", Fri, 21 Nov 2014 01:11:07 UTC +00:00], ["user_id", 1]]
---
  def create
    feed_id = params[:feed_id]
    user_id = current_user.id
    newfollow = FeedFollow.new({user_id: user_id, feed_id: feed_id})
    if newfollow.save

SELECT "feed_follows".* FROM "feed_follows" WHERE (feed_id = 'undefined' AND user_id = 1) ORDER BY "feed_follows"."id" ASC LIMIT 1
---
  def destroy
    feed_id = params[:feed_id]
    user_id = current_user.id
    follow = FeedFollow.where(['feed_id = :feed AND user_id = :user',
                               {feed: feed_id, user: user_id }])